{
    "login_credentials": {
        "username": "NIL299",
        "password": "nilam@299t"
    },    "event_data": {
        "event_id": "TEAM_HACKATHON_2025",
        "event_name": "Campus Team Hackathon Challenge 2025",
        "event_type": "competition",
        "short_description": "An exciting team-based hackathon where groups of students collaborate to develop innovative software solutions and applications within 48 hours.",
        "detailed_description": "Welcome to the Campus Team Hackathon Challenge 2025, the ultimate collaborative programming experience for university students! This intensive 48-hour event brings together teams of passionate developers, designers, and innovators to create groundbreaking software solutions. Teams of 2-5 members will work together to design, develop, and deploy complete applications or solutions addressing real-world challenges. The hackathon provides multiple problem statements ranging from social impact solutions, sustainability projects, educational technology, healthcare innovations, to cutting-edge AI/ML applications. Each team will have access to mentors from leading tech companies, cloud computing resources, development tools, and APIs from sponsor organizations. Teams will be evaluated on innovation, technical implementation, user experience design, business viability, and presentation quality. The event features workshops on modern development frameworks, design thinking sessions, and networking opportunities with industry professionals. Special award categories include Best Innovation, Most Impactful Solution, Best Technical Implementation, People's Choice Award, and Best Beginner Team. This completely free event includes all meals, snacks, accommodation support for outstation participants, development resources, and networking opportunities. All participants receive certificates and swag, while winning teams earn cash prizes, internship opportunities, and startup incubation support. Join us for an unforgettable weekend of coding, creativity, and collaboration!",
        "organizing_department": "Department of Computer Science & Engineering",
        "organizers": [
            "Dr. Rajesh Mehta - Department Chair",
            "Prof. Anita Kumar - Hackathon Director",
            "Dr. Vikash Gupta - Technical Mentor Lead",
            "Ms. Shreya Patel - Industry Partnerships",
            "Mr. Rohit Singh - Student Team Coordinator"
        ],
        "contacts": [
            {
                "name": "Prof. Anita Kumar",
                "contact": "anita.kumar@techsummit.edu"
            },
            {
                "name": "Hackathon Helpdesk",
                "contact": "+91-88765-54321"
            },
            {
                "name": "Team Registration Support",
                "contact": "teams@campushackathon.com"
            }
        ],
        "start_date": "2025-08-15",
        "start_time": "18:00",
        "end_date": "2025-08-17",
        "end_time": "18:00",
        "registration_start_date": "2025-06-15",
        "registration_start_time": "10:00",
        "registration_end_date": "2025-08-10",
        "registration_end_time": "23:59",
        "certificate_end_date": "2025-09-30",
        "certificate_end_time": "23:59",
        "mode": "hybrid",
        "venue": "University Innovation Hub - Team Collaboration Spaces and Virtual Development Platform",
        "target_outcomes": "By participating in the Campus Team Hackathon Challenge, participants will be able to:\n• Develop strong collaborative programming and project management skills\n• Learn agile development methodologies and rapid prototyping techniques\n• Gain experience in full-stack development and system design\n• Practice effective team communication and task delegation\n• Build innovative solutions addressing real-world problems\n• Receive mentorship from industry experts and successful entrepreneurs\n• Create portfolio projects demonstrating technical and teamwork abilities\n• Network with potential co-founders, teammates, and industry professionals\n• Experience startup-like development environments and constraints\n• Improve presentation and pitching skills for technical solutions\n• Learn modern development tools, frameworks, and cloud technologies\n• Gain exposure to emerging technologies like AI/ML, blockchain, and IoT\n• Develop problem-solving approaches for complex technical challenges",
        "prerequisites": "Open to all university students with programming experience. Teams should have diverse skills including development, design, and project management. At least one team member should have solid programming experience in modern languages (Python, JavaScript, Java, etc.). Teams are encouraged to include members with different skill sets such as frontend development, backend development, UI/UX design, data science, or business analysis. No previous hackathon experience required, but enthusiasm for rapid development and learning is essential.",
        "what_to_bring": "Personal laptops for all team members with development environments set up, phone chargers and power banks, extension cords for team workspace, sleeping bags and pillows for overnight stays, personal hygiene items and change of clothes, notebooks and whiteboards for planning and design, student ID cards for all team members, team collaboration tools accounts (Slack, Trello, etc.), and energy drinks and snacks for late-night coding sessions.",
        "registration_type": "free",
        "registration_mode": "team",
        "registration_fee": 0.0,
        "team_size_min": 2,
        "team_size_max": 5,
        "fee_description": "This hackathon is completely FREE for all participants, sponsored by the Department of Computer Science and our industry partners. Registration includes access to all 48 hours of the event, dedicated team workspaces, high-speed internet and power outlets, all meals and refreshments (breakfast, lunch, dinner, and late-night snacks), mentorship sessions with industry experts, access to premium development tools and cloud credits, networking sessions with sponsors and alumni, hackathon t-shirts and swag bags for all team members, accommodation support for outstation teams, and certificates for all participants. Winning teams receive additional prizes including cash rewards, internship opportunities, startup incubation support, and direct recruitment opportunities with sponsor companies.",
        "max_participants": 200,
        "min_participants": 20,
        "certificate_template_path": "s:\\Projects\\UCG_v2\\Admin\\data\\team.html",
        "asset_files": [
            "s:\\Projects\\UCG_v2\\Admin\\data\\hackathon_resources.zip",
            "s:\\Projects\\UCG_v2\\Admin\\data\\api_documentation.pdf"
        ],
        "registrations": []
    }
}
