{
    "login_credentials": {
        "username": "SHIV9090",
        "password": "Shiv@9090"
    },
    "event_data": {
        "event_id": "INDIVIDUAL_CODE_CHALLENGE_2025",
        "event_name": "Campus Individual Coding Challenge 2025",
        "event_type": "competition",
        "short_description": "An exciting individual coding competition where students can showcase their programming talent and problem-solving skills through a series of technical challenges.",
        "detailed_description": "Welcome to the Campus Individual Coding Challenge 2025, the premier solo programming competition for university students! This intensive event brings together passionate coders, algorithmic thinkers, and tech enthusiasts to demonstrate their individual programming prowess in a supportive yet competitive environment. Each participant will tackle a series of challenging coding problems that test their knowledge of algorithms, data structures, optimization techniques, and creative problem-solving. The competition offers challenges across multiple difficulty levels from beginner to advanced, ensuring every student can find appropriate problems to solve. Participants will work on algorithmic puzzles, debugging tasks, implementation challenges, and optimization problems that simulate real-world programming scenarios. Students will be evaluated on code correctness, efficiency, time complexity, space complexity, and elegance of solution. Mentors from leading tech companies will provide guidance throughout the event and share industry best practices. The competition features multiple rounds with increasing difficulty, allowing participants to advance based on their performance. Special award categories include Best Algorithm Implementation, Most Efficient Solution, Best Debugging Skills, and Most Creative Approach. This free event aims to help students showcase their individual coding abilities, build their personal technical portfolio, and connect with potential employers. All participants will receive certificates, with top performers earning special recognition and prizes. Don't miss this opportunity to challenge yourself, demonstrate your programming skills, and join a community of passionate individual coders!",
        "organizing_department": "Department of Computer Science & Engineering",
        "organizers": [
            "Dr. Rajesh Mehta - Department Chair",
            "Prof. Neha Singh - Competition Director",
            "Dr. Amit Patel - Technical Challenge Designer",
            "Ms. Priya Sharma - Industry Relations Lead",
            "Mr. Arjun Reddy - Student Coordinator"
        ],
        "contacts": [
            {
                "name": "Prof. Neha Singh",
                "contact": "neha.singh@techsummit.edu"
            },
            {
                "name": "Event Helpdesk",
                "contact": "+91-88765-43210"
            },
            {
                "name": "Registration Support",
                "contact": "register@campustechsummit.com"
            }
        ],
        "start_date": "2025-07-15",
        "start_time": "09:00",
        "end_date": "2025-07-17",
        "end_time": "18:00",
        "registration_start_date": "2025-06-01",
        "registration_start_time": "10:00",
        "registration_end_date": "2025-07-10",
        "registration_end_time": "23:59",
        "certificate_end_date": "2025-08-31",
        "certificate_end_time": "23:59",
        "mode": "hybrid",
        "venue": "University Computer Science Building - Individual Coding Labs and Virtual Competition Platform",
        "target_outcomes": "By participating in the Campus Individual Coding Challenge, participants will be able to:\n• Enhance individual problem-solving abilities and algorithmic thinking\n• Develop efficient coding techniques under time constraints\n• Practice writing clean, efficient, and maintainable code\n• Strengthen personal coding style and approach to problems\n• Improve debugging and optimization techniques\n• Receive direct feedback from industry professionals on code quality\n• Build a portfolio of individual solutions to showcase to employers\n• Network with tech industry recruiters and engineering managers\n• Experience realistic development scenarios and constraints\n• Improve technical documentation and code explanation skills\n• Develop time management strategies for programming challenges\n• Gain exposure to industry tools, frameworks and best practices\n• Benchmark skills against peers in a competitive environment",
        "prerequisites": "Open to all university students with basic programming knowledge. Participants should have experience with programming concepts and algorithms. Prior experience with at least one programming language (Java, Python, C++, JavaScript, etc.) is required. Participants will be categorized based on their experience level to ensure fair competition. Students should be prepared to work independently under time constraints.",
        "what_to_bring": "Personal laptop with development environment pre-installed, power bank or charger, access to GitHub or other code repositories, USB drive for code backup, student ID card for registration verification, notebook and pen for algorithm design and planning, snacks and water bottle for extended coding sessions, and a positive attitude ready for individual problem-solving challenges.",
        "registration_type": "free",
        "registration_mode": "individual",
        "registration_fee": 0.0,
        "fee_description": "This is a completely free event sponsored by the Department of Computer Science and our industry partners. Participation includes access to all competition rounds, mentoring sessions, workshops, and networking activities. Participants will receive free meals and refreshments throughout the event, competition t-shirt, digital certificate of participation, access to exclusive learning resources and coding templates, and the opportunity to interview with sponsoring companies. Pre-registered participants will also receive special welcome kits with branded merchandise, technical resources, and sponsor giveaways.",
        "max_participants": 300,
        "min_participants": 50,
        "certificate_template_path": "s:\\Projects\\UCG_v2\\Admin\\data\\technical_1.html",
        "asset_files": [
            "s:\\Projects\\UCG_v2\\Admin\\data\\sample_asset1.txt"
        ],
        "registrations": []
    }
}
