{
    "login_credentials": {
        "username": "SHIV9090",
        "password": "Shiv@9090"
    },
    "event_data": {
        "event_id": "INNOVATION_CHALLENGE_2025",
        "event_name": "Student Innovation Challenge 2025",
        "event_type": "competition",
        "short_description": "A free team-based innovation challenge where student teams collaborate to solve real-world problems using creative thinking and technology.",
        "detailed_description": "Join the ultimate Student Innovation Challenge 2025, where creativity meets technology to solve tomorrow's problems today! This exciting free competition brings together diverse student teams to tackle real-world challenges through innovative solutions. Teams will work collaboratively over three intensive days to identify problems, brainstorm solutions, prototype ideas, and present their innovations to a panel of industry experts and judges. The challenge covers multiple domains including sustainable technology, social impact solutions, healthcare innovations, educational technology, environmental conservation, and digital transformation. Participants will have access to mentorship from industry professionals, startup founders, and academic experts throughout the event. The program includes ideation workshops, design thinking sessions, rapid prototyping labs, technical development support, and presentation skills training. Teams will learn problem-solving methodologies, user-centered design principles, market validation techniques, and effective collaboration strategies. The challenge provides access to cutting-edge tools, software licenses, prototyping materials, 3D printing facilities, and technical resources. Expert mentors will guide teams through the innovation process, helping them refine their ideas and develop compelling presentations. The event culminates in a grand finale where teams pitch their solutions to judges from leading technology companies, venture capital firms, and social impact organizations. Winners receive recognition, certificates, mentorship opportunities, and potential pathways to further develop their innovations through incubator programs and startup accelerators.",
        "organizing_department": "Department of Innovation & Entrepreneurship",
        "organizers": [
            "Dr. Anita Sharma - Innovation Program Director",
            "Prof. Vikram Singh - Technology Challenge Coordinator",
            "Ms. Riya Gupta - Student Innovation Mentor",
            "Mr. Karan Patel - Industry Partnership Manager",
            "Dr. Sonia Kumar - Design Thinking Specialist"
        ],
        "contacts": [
            {
                "name": "Dr. Anita Sharma",
                "contact": "anita.sharma@innovation.edu"
            },
            {
                "name": "Challenge Coordinator - Prof. Vikram Singh",
                "contact": "+91-99887-65432"
            },
            {
                "name": "Innovation Support Team",
                "contact": "innovation@challenge.edu"
            }
        ],
        "start_date": "2025-08-15",
        "start_time": "09:00",
        "end_date": "2025-08-17",
        "end_time": "18:00",
        "registration_start_date": "2025-07-01",
        "registration_start_time": "00:01",
        "registration_end_date": "2025-08-10",
        "registration_end_time": "23:59",
        "certificate_end_date": "2025-09-30",
        "certificate_end_time": "23:59",
        "mode": "hybrid",
        "venue": "Innovation Hub - Maker Spaces, Collaboration Labs, Presentation Halls, and Virtual Meeting Rooms",
        "target_outcomes": "By the end of this Innovation Challenge, participants will be able to:\n• Apply design thinking methodologies to identify and solve real-world problems\n• Collaborate effectively in diverse teams to develop innovative solutions\n• Create functional prototypes using available tools and technologies\n• Conduct user research and validate solution concepts with target audiences\n• Develop compelling presentations and pitch ideas to stakeholders\n• Understand the innovation ecosystem and pathways from idea to implementation\n• Build networks with peers, mentors, and industry professionals\n• Gain experience in rapid prototyping and iterative development processes\n• Learn project management skills for innovation and product development\n• Develop critical thinking and problem-solving capabilities\n• Understand intellectual property basics and innovation protection\n• Explore entrepreneurship opportunities and startup development pathways",
        "prerequisites": "Open to all students regardless of academic background. No specific technical skills required as teams should have diverse skill sets. Strong motivation to solve problems and willingness to collaborate in team environment. Basic communication skills and openness to learning new approaches.",
        "what_to_bring": "Laptop or mobile device for research and development, notebook and writing materials for brainstorming, any specific skills or expertise to contribute to team, willingness to think creatively and take on challenges, comfortable clothing for hands-on prototyping activities, and enthusiasm for collaborative problem-solving and innovation.",
        "registration_type": "free",
        "registration_mode": "team",
        "registration_fee": 0.0,
        "fee_description": "This Innovation Challenge is completely free for all participants as part of our commitment to fostering student innovation and creativity. All teams receive access to mentorship sessions with industry experts, comprehensive resource library including templates, tools, and guides, prototyping materials and 3D printing access, software licenses and development tools, all meals and refreshments throughout the 3-day challenge, certificates of participation and achievement for all team members, networking opportunities with industry professionals and potential employers, access to innovation workshops and skill-building sessions, and follow-up support for teams interested in further developing their solutions. Top teams also receive special recognition, potential incubator program invitations, and ongoing mentorship opportunities with successful entrepreneurs and innovators.",
        "max_participants": 120,
        "min_participants": 30,
        "team_size_min": 3,
        "team_size_max": 5,
        "certificate_template_path": "s:\\Projects\\UCG_v2\\Admin\\data\\technical_2.html",
        "asset_files": [
            "s:\\Projects\\UCG_v2\\Admin\\data\\sample_asset1.txt"
        ]
    }
}