{
    "login_credentials": {
        "username": "NIL299",
        "password": "nilam@299t"
    },
    "event_data": {        "event_id": "TECH_STARTUP_BOOTCAMP_2025",
        "event_name": "Tech Startup Bootcamp 2025",
        "event_type": "workshop",
        "short_description": "An intensive 5-day paid team-based bootcamp for aspiring entrepreneurs to build, validate, and launch their tech startup ideas with expert mentorship.",
        "detailed_description": "Transform your innovative ideas into successful tech startups! This comprehensive 5-day Tech Startup Bootcamp is designed for ambitious teams ready to turn their entrepreneurial dreams into reality. Teams will work together through the complete startup journey from ideation to product launch, guided by successful entrepreneurs, venture capitalists, and industry experts. The bootcamp covers essential startup fundamentals including market research and validation, customer discovery interviews, business model development, financial planning and fundraising strategies, technical product development, and go-to-market planning. Participants will learn lean startup methodologies, agile development practices, and rapid prototyping techniques using cutting-edge tools and platforms. Teams will develop minimum viable products (MVPs), conduct user testing sessions, and refine their solutions based on real market feedback. The program includes intensive workshops on pitch deck creation, investor presentations, legal considerations for startups, intellectual property protection, and scaling strategies. Expert mentors include successful tech founders, venture capital partners, angel investors, product managers from leading tech companies, and startup accelerator directors. Teams will have access to premium development tools, cloud computing credits, design software, market research databases, and prototype development resources. The bootcamp features mock investor pitch sessions, peer feedback rounds, and networking events with the startup ecosystem. Participants will learn about different funding stages, equity distribution, team building, and hiring strategies for growing startups. The program culminates in a Demo Day where teams present their validated startup concepts to a panel of real investors and industry leaders. Outstanding teams receive follow-up meetings with venture capital firms, connections to startup accelerators, and ongoing mentorship opportunities.",
        "organizing_department": "Department of Entrepreneurship & Business Innovation",
        "organizers": [
            "Dr. Rajesh Gupta - Startup Accelerator Director",
            "Ms. Priya Malhotra - Venture Capital Partner",
            "Prof. Vikash Sharma - Entrepreneurship Chair",
            "Mr. Arjun Kapoor - Tech Startup Mentor",
            "Dr. Neha Agarwal - Business Strategy Professor"
        ],
        "contacts": [
            {
                "name": "Dr. Rajesh Gupta",
                "contact": "rajesh.gupta@startup.edu"
            },
            {
                "name": "Bootcamp Director - Ms. Priya Malhotra",
                "contact": "+91-98876-54321"
            },
            {
                "name": "Startup Bootcamp Support",
                "contact": "support@techstartup.edu"
            }
        ],
        "start_date": "2025-09-15",
        "start_time": "09:00",
        "end_date": "2025-09-19",
        "end_time": "18:00",
        "registration_start_date": "2025-08-01",
        "registration_start_time": "00:01",
        "registration_end_date": "2025-09-10",
        "registration_end_time": "23:59",
        "certificate_end_date": "2025-10-31",
        "certificate_end_time": "23:59",
        "mode": "hybrid",
        "venue": "Entrepreneurship Hub - Innovation Labs, Pitch Rooms, Collaboration Spaces, and Virtual Meeting Rooms",
        "target_outcomes": "By the end of this Tech Startup Bootcamp, participants will be able to:\n• Validate business ideas using lean startup methodologies and customer discovery techniques\n• Develop comprehensive business models and financial projections for tech startups\n• Build minimum viable products (MVPs) using modern development tools and frameworks\n• Create compelling pitch decks and deliver persuasive investor presentations\n• Understand funding landscapes including angel investment, venture capital, and alternative financing\n• Navigate legal and regulatory considerations for starting and scaling tech companies\n• Implement go-to-market strategies and customer acquisition tactics\n• Build and manage diverse teams with complementary skills and expertise\n• Network with investors, mentors, and fellow entrepreneurs in the startup ecosystem\n• Apply agile development and rapid prototyping methodologies to product development\n• Understand intellectual property protection and competitive analysis strategies\n• Develop sustainable business operations and scaling plans for growth",
        "prerequisites": "Basic business acumen and entrepreneurial mindset. Some technical background helpful but not mandatory as teams should include diverse skill sets. Previous startup experience beneficial but not required. Strong communication and collaboration skills essential. Commitment to intensive 5-day program and post-bootcamp implementation.",
        "what_to_bring": "Laptop with development tools and design software, business idea or problem statement to work on, notebook for strategy planning and note-taking, professional attire for pitch presentations, willingness to receive and provide constructive feedback, commitment to team collaboration and intensive work sessions, and openness to pivoting ideas based on market validation feedback",
        "registration_type": "paid",
        "registration_mode": "team",
        "registration_fee": 15000.0,
        "fee_description": "The registration fee of ₹15,000 per team (₹3,000 per participant for 5-member teams) covers all five days of intensive startup training and resources. The fee includes access to premium business development tools and software licenses, comprehensive startup resource library including templates, frameworks, and guides, mentorship sessions with successful entrepreneurs and venture capital partners, mock investor pitch sessions with real feedback from industry experts, certificates of completion and startup readiness validation, exclusive startup toolkit with legal templates, financial models, and business plan frameworks, all meals and refreshments throughout the 5-day intensive program, networking dinner with investors, successful founders, and startup ecosystem leaders, cloud computing credits and development resources for MVP building, and three months of post-bootcamp mentorship and support. Teams also receive priority access to startup accelerator programs, potential investor introductions and follow-up meetings, and lifetime access to exclusive entrepreneur alumni network. Early bird discount of 25% available for registrations before August 15th. Additional team member discounts available for teams larger than 5 members.",
        "max_participants": 100,
        "min_participants": 15,
        "team_size_min": 3,
        "team_size_max": 6,
        "certificate_template_path": "s:\\Projects\\UCG_v2\\Admin\\data\\sample_certificate_template.html",
        "asset_files": [
            "s:\\Projects\\UCG_v2\\Admin\\data\\sample_asset1.txt"
        ]
    }
}