{
    "login_credentials": {
        "username": "NIL299",
        "password": "nilam@299t"
    },
    "event_data": {
        "event_id": "SOCIAL_IMPACT_CHALLENGE_2025",
        "event_name": "Social Impact Challenge 2025",
        "event_type": "social_challenge",
        "short_description": "Free 3-day team-based social impact challenge focused on developing sustainable solutions for community problems using technology and innovation.",
        "detailed_description": "Make a difference while learning at the Social Impact Challenge 2025! This transformative 3-day team-based event brings together passionate students, social entrepreneurs, and change-makers to tackle pressing community challenges through innovative solutions. Teams will identify real social problems in areas such as education inequality, environmental sustainability, healthcare access, poverty alleviation, digital divide, and community development. The challenge emphasizes human-centered design thinking, social entrepreneurship, and sustainable impact measurement. Participants will engage with local NGOs, community leaders, and social enterprises to understand ground-level challenges and develop practical, scalable solutions. The event features design thinking workshops, community research methodologies, impact measurement frameworks, and social innovation strategies. Teams will create prototypes, pilot programs, or comprehensive social venture proposals that address identified community needs. Expert facilitators include social entrepreneurs, NGO leaders, policy makers, and sustainable development experts who will guide teams through ideation, validation, and solution development processes. The challenge includes field visits to community organizations, interviews with beneficiaries, and hands-on experience with social impact tools. Teams will learn about grant writing, social fundraising, partnership building, and scaling social ventures. The event culminates in impact presentations where teams demonstrate their solutions' potential for creating positive social change. Judges include social impact investors, NGO directors, and community development specialists. Winning solutions receive implementation grants, mentorship from social entrepreneurs, and opportunities to pilot their initiatives with partner organizations. The challenge also features networking sessions with social impact professionals, career guidance in social sector, and exposure to various social innovation models. Participants develop empathy, systems thinking, and collaborative problem-solving skills while contributing to meaningful social causes.",
        "organizing_department": "Department of Social Innovation & Community Engagement",
        "organizers": [
            "Dr. Meera Patel - Social Innovation Research Director",
            "Mr. Rohit Sharma - Community Engagement Coordinator",
            "Prof. Kavita Singh - Sustainable Development Expert",
            "Ms. Anjali Gupta - NGO Partnership Manager",
            "Dr. Amit Verma - Social Entrepreneurship Program Lead"
        ],
        "contacts": [
            {
                "name": "Dr. Meera Patel",
                "contact": "meera.patel@socialinnovation.edu"
            },
            {
                "name": "Challenge Coordinator - Ms. Anjali Gupta",
                "contact": "+91-87654-12345"
            },
            {
                "name": "Community Impact Team",
                "contact": "impact@socialchallenge.edu"
            }
        ],
        "start_date": "2025-11-20",
        "start_time": "08:00",
        "end_date": "2025-11-22",
        "end_time": "18:30",
        "registration_start_date": "2025-10-10",
        "registration_start_time": "00:01",
        "registration_end_date": "2025-11-13",
        "registration_end_time": "23:59",
        "certificate_end_date": "2025-12-31",
        "certificate_end_time": "23:59",
        "mode": "hybrid",
        "venue": "Community Impact Center - Main Hall, Design Studios, and Community Partner Locations (with virtual collaboration tools)",
        "target_outcomes": "By the end of this social impact challenge, participating teams will be able to:\n• Identify and analyze complex social problems using research and community engagement\n• Apply design thinking methodologies to develop human-centered solutions\n• Create viable social venture proposals with clear impact measurement frameworks\n• Understand social entrepreneurship principles and sustainable business models\n• Develop empathy and cultural sensitivity through direct community interaction\n• Design and prototype innovative solutions addressing real community needs\n• Present compelling social impact proposals to stakeholders and potential funders\n• Build partnerships with NGOs, community organizations, and social enterprises\n• Apply systems thinking to understand root causes of social challenges\n• Learn grant writing, social fundraising, and resource mobilization strategies\n• Develop leadership skills in social change and community development\n• Gain practical experience in measuring and evaluating social impact",
        "prerequisites": "Passion for social causes and community development. Interest in making positive social impact through innovation. Basic understanding of social issues is helpful but not required. Strong empathy and communication skills for community interaction. Willingness to engage with diverse communities and stakeholders.",
        "what_to_bring": "Laptop for research and presentation development, notebook for field observations and interviews, comfortable clothing for community visits, open mind and cultural sensitivity for community engagement, collaborative spirit for diverse team environments, creativity for innovative solution development, patience and active listening skills for stakeholder interactions, and commitment to creating meaningful social change",
        "registration_type": "free",
        "registration_mode": "team",
        "registration_fee": 0.0,
        "fee_description": "This social impact challenge is completely FREE for all participating teams. The program includes comprehensive design thinking and social innovation workshops, guided community field visits and stakeholder interactions, mentorship from experienced social entrepreneurs and NGO leaders, access to social impact measurement tools and frameworks, networking opportunities with social sector professionals, certificates of participation and social impact credentials, resource materials on social entrepreneurship and community development, meals and transportation for community visits, and potential implementation grants for winning solutions. Selected teams also receive continued mentorship support, access to social impact incubator programs, and connections with funding organizations and implementing partners.",
        "max_participants": 100,
        "min_participants": 30,
        "team_size_min": 4,
        "team_size_max": 6,
        "certificate_template_path": "s:\\Projects\\UCG_v2\\Admin\\data\\sample_certificate_template.html",
        "asset_files": [
            "s:\\Projects\\UCG_v2\\Admin\\data\\sample_asset1.txt"
        ]
    }
}
