{
    "login_credentials": {
        "username": "NIL299",
        "password": "nilam@299t"
    },
    "event_data": {
        "event_id": "STARTUP_PITCH_COMPETITION_2025",
        "event_name": "Startup Pitch Competition 2025",
        "event_type": "competition",
        "short_description": "Free 2-day team-based startup pitch competition where teams develop innovative business ideas and present to industry experts and investors.",
        "detailed_description": "Transform your entrepreneurial dreams into reality at the Startup Pitch Competition 2025! This intensive 2-day team-based competition is designed for aspiring entrepreneurs, business students, and innovators who want to develop and pitch groundbreaking startup ideas. Teams will work collaboratively to identify market opportunities, develop business models, create MVP prototypes, and craft compelling pitch presentations. The competition covers diverse sectors including EdTech, FinTech, HealthTech, GreenTech, and Social Impact ventures. Participants will receive mentorship from successful entrepreneurs, venture capitalists, and industry experts throughout the event. The program includes workshops on business model canvas, market research techniques, financial projections, pitch deck creation, and presentation skills. Teams will have access to online research tools, design software, and business planning resources. Expert mentors will provide guidance on idea validation, competitive analysis, revenue models, and go-to-market strategies. The competition features multiple pitch rounds including elevator pitches, detailed presentations, and Q&A sessions with judges panel comprising of angel investors, startup founders, and business leaders. Winning teams receive seed funding opportunities, incubator program access, mentorship packages, and networking connections with potential investors. The event also includes networking sessions, startup showcase, and panel discussions with successful entrepreneurs sharing their journey. Participants will learn essential entrepreneurial skills including market validation, customer development, product-market fit, and fundraising strategies. The competition encourages innovative thinking, teamwork, and real-world business application. All backgrounds are welcome - from technical students to business majors, design thinkers to marketing enthusiasts. Teams must present viable business solutions that address real market needs and demonstrate scalability potential.",
        "organizing_department": "Department of Entrepreneurship & Innovation Center",
        "organizers": [
            "Dr. Rajesh Kumar - Entrepreneurship Development Director",
            "Ms. Priya Agarwal - Startup Incubator Head",
            "Prof. Vikram Shah - Business Strategy Expert",
            "Mr. Ankit Jain - Venture Capital Advisor",
            "Dr. Neha Sharma - Innovation & Technology Transfer Lead"
        ],
        "contacts": [
            {
                "name": "Dr. Rajesh Kumar",
                "contact": "rajesh.kumar@entrepreneurship.edu"
            },
            {
                "name": "Competition Coordinator - Ms. Priya Agarwal",
                "contact": "+91-98765-43210"
            },
            {
                "name": "Startup Support Team",
                "contact": "support@startupcompetition.edu"
            }
        ],
        "start_date": "2025-10-15",
        "start_time": "09:30",
        "end_date": "2025-10-16",
        "end_time": "17:30",
        "registration_start_date": "2025-09-01",
        "registration_start_time": "00:01",
        "registration_end_date": "2025-10-08",
        "registration_end_time": "23:59",
        "certificate_end_date": "2025-11-30",
        "certificate_end_time": "23:59",
        "mode": "offline",
        "venue": "Business Innovation Center - Main Auditorium, Conference Halls A & B, and Startup Incubation Labs",
        "target_outcomes": "By the end of this startup pitch competition, participating teams will be able to:\n• Develop comprehensive business plans for innovative startup ideas\n• Create compelling pitch presentations that effectively communicate value propositions\n• Conduct thorough market research and competitive analysis for their business concepts\n• Design and validate business models using lean startup methodologies\n• Build minimal viable product (MVP) prototypes or detailed conceptual frameworks\n• Present confidently to investors, judges, and potential stakeholders\n• Understand funding landscape including angel investment, venture capital, and grants\n• Apply customer development techniques to validate market demand\n• Create financial projections and understand key business metrics\n• Network effectively with entrepreneurs, investors, and industry professionals\n• Develop teamwork and leadership skills in high-pressure entrepreneurial environment\n• Gain insights into startup ecosystem and entrepreneurial career opportunities",
        "prerequisites": "Strong interest in entrepreneurship and business innovation. Basic understanding of business concepts is helpful but not mandatory. Creativity and problem-solving mindset are essential. Team collaboration skills and willingness to work intensively over 2 days. Open to learning business development tools and pitch presentation techniques.",
        "what_to_bring": "Laptop for research and presentation creation, mobile device for market research and surveys, notepads and writing materials for brainstorming, creativity and innovative thinking approach, collaborative team spirit and leadership qualities, willingness to receive and act on feedback from mentors, professional attitude for networking with industry experts, and commitment to developing a viable business concept",
        "registration_type": "free",
        "registration_mode": "team",
        "registration_fee": 0.0,
        "fee_description": "This startup pitch competition is completely FREE for all participating teams. The program includes access to expert mentorship sessions throughout the competition, comprehensive entrepreneurship workshops and masterclasses, business planning tools and software access, networking opportunities with successful entrepreneurs and investors, detailed feedback sessions with industry experts, certificates of participation for all team members, startup resource materials and business plan templates, refreshments and meals during the event, and potential seed funding opportunities for winning teams. Top performers also receive access to business incubation programs, continued mentorship support, and connections with angel investor networks.",
        "max_participants": 80,
        "min_participants": 24,
        "team_size_min": 3,
        "team_size_max": 4,
        "certificate_template_path": "s:\\Projects\\UCG_v2\\Admin\\data\\sample_certificate_template.html",
        "asset_files": [
            "s:\\Projects\\UCG_v2\\Admin\\data\\sample_asset1.txt"
        ]
    }
}
